A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId ClassificationNotSetInFamily { get; }
  Visual Basic
Public Shared ReadOnly Property ClassificationNotSetInFamily As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ClassificationNotSetInFamily {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace